# d = {'satisfied': [{'BMI': 57.2, '年龄': 14.0, '性别': '男'}], 'BMI满足且年龄满足且性别不满足': [{'BMI': 58.2, '年龄': 14.1, '性别': '女'}], 'BMI满足且年龄不满足且性别满足': [{'BMI': 40.9, '年龄': 27.1, '性别': '男'}], 'BMI满足且年龄不满足且性别不满足': [{'BMI': 43.2, '年龄': 18.7, '性别': '女'}], 'BMI不满足且年龄满足且性别满足': [{'BMI': 60.1, '年龄': 14.2, '性别': '男'}], 'BMI不满足且年龄满足且性别不满足': [{'BMI': 60.0, '年龄': 14.4, '性别': '女'}], 'BMI不满足且年龄不满足且性别满足': [{'BMI': 12.0, '年龄': 62.7, '性别': '男'}], 'BMI不满足且年龄不满足且性别不满足': [{'BMI': 60.0, '年龄': 13.8, '性别': '女'}]}
#
#
# del d['satisfied']
# print(d)

l = []
l1 = [1,2]
print(len(l))