# coding=utf-8
#***************************************************************
# Author     : John
# Created on : 2025-11-10
# Description: 体重管理 - 体重状态判断
# todo 接口文档
# http://192.168.0.243:8014/doc.html#/default/
# 登录接口
# http://192.168.0.243:8011/doc.html#/chc-auth/%E7%99%BB%E5%BD%95%E6%A8%A1%E5%9D%97/loginUsingPOST
# 保存体重管理报告接口
# http://192.168.0.243:8014/doc.html#/default/Weight-%E4%BD%93%E9%87%8D%E6%8A%A5%E5%91%8A%E8%AE%B0%E5%BD%95%E8%A1%A8/saveOrUpdateWeightManageUsingPOST
# 注意：登录接口端口8011，保存体重管理报告接口端口8014

# todo 测试数据
# 数据源 - 体重状态判断1.23.5
# https://docs.qq.com/sheet/DYmxVUGFZRWhTSHND?tab=01ia7z
# 使用ai，将表格内容转为列表，如：(7<=年龄<7.5 and 13.9<=BMI<17.0 and 性别=男) or (7.5<=年龄<8 and 13.9<=BMI<17.4 and 性别=男) ，将以上格式转换成['(7<=年龄<8 and 13.9>BMI and 性别=男)',' (8<=年龄<9 and 14.0>BMI and 性别=男)']格式
#***************************************************************
from ChcPO import *
# todo 1 测试数据
Chc_PO = ChcPO('310110195303084226')

# todo 2 登录
Chc_PO.curlLogin('{"username": "lbl","password": "Qa@123456"}')


# todo 3 执行（参考测试数据转换为列表）
# todo 7-17岁学生 - 体重偏低
# Chc_PO.main("7-17岁学生", "体重偏低", [
#     '(7<=年龄<8 and 13.9>BMI and 性别=男)',
#     '(8<=年龄<9 and 14.0>BMI and 性别=男)',
#     '(9<=年龄<9.5 and 14.1>BMI and 性别=男)',
#     '(9.5<=年龄<10 and 14.2>BMI and 性别=男)',
#     '(10<=年龄<10.5 and 14.4>BMI and 性别=男)',
#     '(10.5<=年龄<11 and 14.6>BMI and 性别=男)',
#     '(11<=年龄<11.5 and 14.9>BMI and 性别=男)',
#     '(11.5<=年龄<12 and 15.1>BMI and 性别=男)',
#     '(12<=年龄<12.5 and 15.4>BMI and 性别=男)',
#     '(12.5<=年龄<13 and 15.6>BMI and 性别=男)',
#     '(13<=年龄<13.5 and 15.9>BMI and 性别=男)',
#     '(13.5<=年龄<14 and 16.1>BMI and 性别=男)',
#     '(14<=年龄<14.5 and 16.4>BMI and 性别=男)',
#     '(14.5<=年龄<15 and 16.7>BMI and 性别=男)',
#     '(15<=年龄<15.5 and 16.9>BMI and 性别=男)',
#     '(15.5<=年龄<16 and 17.0>BMI and 性别=男)',
#     '(16<=年龄<16.5 and 17.3>BMI and 性别=男)',
#     '(16.5<=年龄<17 and 17.5>BMI and 性别=男)',
#     '(17<=年龄<17.5 and 17.7>BMI and 性别=男)',
#     '(17.5<=年龄<18 and 17.9>BMI and 性别=男)',
#     '(年龄=18 and 17.9>BMI and 性别=男)',
#     '(7<=年龄<7.5 and 13.4>BMI and 性别=女)',
#     '(7.5<=年龄<8 and 13.5>BMI and 性别=女)',
#     '(8<=年龄<8.5 and 13.6>BMI and 性别=女)',
#     '(8.5<=年龄<9 and 13.7>BMI and 性别=女)',
#     '(9<=年龄<9.5 and 13.8>BMI and 性别=女)',
#     '(9.5<=年龄<10 and 13.9>BMI and 性别=女)',
#     '(10<=年龄<10.5 and 14.0>BMI and 性别=女)',
#     '(10.5<=年龄<11 and 14.1>BMI and 性别=女)',
#     '(11<=年龄<11.5 and 14.3>BMI and 性别=女)',
#     '(11.5<=年龄<12 and 14.5>BMI and 性别=女)',
#     '(12<=年龄<12.5 and 14.7>BMI and 性别=女)',
#     '(12.5<=年龄<13 and 14.9>BMI and 性别=女)',
#     '(13<=年龄<13.5 and 15.3>BMI and 性别=女)',
#     '(13.5<=年龄<14 and 15.6>BMI and 性别=女)',
#     '(14<=年龄<14.5 and 16.0>BMI and 性别=女)',
#     '(14.5<=年龄<15 and 16.3>BMI and 性别=女)',
#     '(15<=年龄<15.5 and 16.6>BMI and 性别=女)',
#     '(15.5<=年龄<16 and 16.8>BMI and 性别=女)',
#     '(16<=年龄<16.5 and 17.0>BMI and 性别=女)',
#     '(16.5<=年龄<17 and 17.1>BMI and 性别=女)',
#     '(17<=年龄<17.5 and 17.2>BMI and 性别=女)',
#     '(17.5<=年龄<18 and 17.3>BMI and 性别=女)',
#     '(年龄=18 and 17.3>BMI and 性别=女)'
# ]
# )

# todo 7-17岁学生 - 正常
# Chc_PO.main("7-17岁学生", "正常", [
#     '(7<=年龄<7.5 and 13.9<=BMI<17.0 and 性别=男)',
#     '(7.5<=年龄<8 and 13.9<=BMI<17.4 and 性别=男)',
#     '(8<=年龄<8.5 and 14.0<=BMI<17.8 and 性别=男)',
#     '(8.5<=年龄<9 and 14.0<=BMI<18.1 and 性别=男)',
#     '(9<=年龄<9.5 and 14.1<=BMI<18.5 and 性别=男)',
#     '(9.5<=年龄<10 and 14.2<=BMI<18.9 and 性别=男)',
#     '(10<=年龄<10.5 and 14.4<=BMI<19.2 and 性别=男)',
#     '(10.5<=年龄<11 and 14.6<=BMI<19.6 and 性别=男)',
#     '(11<=年龄<11.5 and 14.9<=BMI<19.9 and 性别=男)',
#     '(11.5<=年龄<12 and 15.1<=BMI<20.3 and 性别=男)',
#     '(12<=年龄<12.5 and 15.4<=BMI<20.7 and 性别=男)',
#     '(12.5<=年龄<13 and 15.6<=BMI<21.0 and 性别=男)',
#     '(13<=年龄<13.5 and 15.9<=BMI<21.4 and 性别=男)',
#     '(13.5<=年龄<14 and 16.1<=BMI<21.9 and 性别=男)',
#     '(14<=年龄<14.5 and 16.4<=BMI<22.3 and 性别=男)',
#     '(14.5<=年龄<15 and 16.7<=BMI<22.6 and 性别=男)',
#     '(15<=年龄<15.5 and 16.9<=BMI<22.9 and 性别=男)',
#     '(15.5<=年龄<16 and 17.0<=BMI<23.1 and 性别=男)',
#     '(16<=年龄<16.5 and 17.3<=BMI<23.3 and 性别=男)',
#     '(16.5<=年龄<17 and 17.5<=BMI<23.5 and 性别=男)',
#     '(17<=年龄<17.5 and 17.7<=BMI<23.7 and 性别=男)',
#     '(17.5<=年龄<18 and 17.9<=BMI<23.8 and 性别=男)',
#     '(年龄=18 and 17.9<=BMI<23.8 and 性别=男)',
#     '(7<=年龄<7.5 and 13.4<=BMI<16.8 and 性别=女)',
#     '(7.5<=年龄<8 and 13.5<=BMI<17.2 and 性别=女)',
#     '(8<=年龄<8.5 and 13.6<=BMI<17.6 and 性别=女)',
#     '(8.5<=年龄<9 and 13.7<=BMI<18.1 and 性别=女)',
#     '(9<=年龄<9.5 and 13.8<=BMI<18.5 and 性别=女)',
#     '(9.5<=年龄<10 and 13.9<=BMI<19.0 and 性别=女)',
#     '(10<=年龄<10.5 and 14.0<=BMI<19.5 and 性别=女)',
#     '(10.5<=年龄<11 and 14.1<=BMI<20.0 and 性别=女)',
#     '(11<=年龄<11.5 and 14.3<=BMI<20.5 and 性别=女)',
#     '(11.5<=年龄<12 and 14.5<=BMI<21.1 and 性别=女)',
#     '(12<=年龄<12.5 and 14.7<=BMI<21.5 and 性别=女)',
#     '(12.5<=年龄<13 and 14.9<=BMI<21.9 and 性别=女)',
#     '(13<=年龄<13.5 and 15.3<=BMI<22.2 and 性别=女)',
#     '(13.5<=年龄<14 and 15.6<=BMI<22.6 and 性别=女)',
#     '(14<=年龄<14.5 and 16.0<=BMI<22.8 and 性别=女)',
#     '(14.5<=年龄<15 and 16.3<=BMI<23.0 and 性别=女)',
#     '(15<=年龄<15.5 and 16.6<=BMI<23.2 and 性别=女)',
#     '(15.5<=年龄<16 and 16.8<=BMI<23.4 and 性别=女)',
#     '(16<=年龄<16.5 and 17.0<=BMI<23.6 and 性别=女)',
#     '(16.5<=年龄<17 and 17.1<=BMI<23.7 and 性别=女)',
#     '(17<=年龄<17.5 and 17.2<=BMI<23.8 and 性别=女)',
#     '(17.5<=年龄<18 and 17.3<=BMI<23.9 and 性别=女)',
#     '(年龄=18 and 17.3<=BMI<23.9 and 性别=女)'
# ])

# todo 7-17岁学生 - 超重
# Chc_PO.main("7-17岁学生", "超重",['(7<= 年龄 < 7.5 and 17.0<=BMI<18.7 and 性别 = 男)','(7.5<= 年龄 < 8 and 17.4<=BMI<19.2 and 性别 = 男)','(8<= 年龄 < 8.5 and 17.8<=BMI<19.7 and 性别 = 男)','(8.5<= 年龄 < 9 and 18.1<=BMI<20.3 and 性别 = 男)','(9<= 年龄 < 9.5 and 18.5<=BMI<20.8 and 性别 = 男)','(9.5<= 年龄 < 10 and 18.9<=BMI<21.4 and 性别 = 男)','(10<= 年龄 < 10.5 and 19.2<=BMI<21.9 and 性别 = 男)','(10.5<= 年龄 < 11 and 19.6<=BMI<22.5 and 性别 = 男)','(11<= 年龄 < 11.5 and 19.9<=BMI<23.0 and 性别 = 男)','(11.5<= 年龄 < 12 and 20.3<=BMI<23.6 and 性别 = 男)','(12<= 年龄 < 12.5 and 20.7<=BMI<24.1 and 性别 = 男)','(12.5<= 年龄 < 13 and 21.0<=BMI<24.7 and 性别 = 男)','(13<= 年龄 < 13.5 and 21.4<=BMI<25.2 and 性别 = 男)','(13.5<= 年龄 < 14 and 21.9<=BMI<25.7 and 性别 = 男)','(14<= 年龄 < 14.5 and 22.3<=BMI<26.1 and 性别 = 男)','(14.5<= 年龄 < 15 and 22.6<=BMI<26.4 and 性别 = 男)','(15<= 年龄 < 15.5 and 22.9<=BMI<26.6 and 性别 = 男)','(15.5<= 年龄 < 16 and 23.1<=BMI<26.9 and 性别 = 男)','(16<= 年龄 < 16.5 and 23.3<=BMI<27.1 and 性别 = 男)','(16.5<= 年龄 < 17 and 23.5<=BMI<27.4 and 性别 = 男)','(17<= 年龄 < 17.5 and 23.7<=BMI<27.6 and 性别 = 男)','(17.5<= 年龄 < 18 and 23.8<=BMI<27.8 and 性别 = 男)','(年龄 = 18 and 23.8<=BMI<27.8 and 性别 = 男)','(7<= 年龄 < 7.5 and 16.8<=BMI<18.5 and 性别 = 女)','(7.5<= 年龄 < 8 and 17.2<=BMI<19.0 and 性别 = 女)','(8<= 年龄 < 8.5 and 17.6<=BMI<19.4 and 性别 = 女)','(8.5<= 年龄 < 9 and 18.1<=BMI<19.9 and 性别 = 女)','(9<= 年龄 < 9.5 and 18.5<=BMI<20.4 and 性别 = 女)','(9.5<= 年龄 < 10 and 19.0<=BMI<21.0 and 性别 = 女)','(10<= 年龄 < 10.5 and 19.5<=BMI<21.5 and 性别 = 女)','(10.5<= 年龄 < 11 and 20.0<=BMI<22.1 and 性别 = 女)','(11<= 年龄 < 11.5 and 20.5<=BMI<22.7 and 性别 = 女)','(11.5<= 年龄 < 12 and 21.1<=BMI<23.3 and 性别 = 女)','(12<= 年龄 < 12.5 and 21.5<=BMI<23.9 and 性别 = 女)','(12.5<= 年龄 < 13 and 21.9<=BMI<24.5 and 性别 = 女)','(13<= 年龄 < 13.5 and 22.2<=BMI<25.0 and 性别 = 女)','(13.5<= 年龄 < 14 and 22.6<=BMI<25.6 and 性别 = 女)','(14<= 年龄 < 14.5 and 22.8<=BMI<25.9 and 性别 = 女)','(14.5<= 年龄 < 15 and 23.0<=BMI<26.3 and 性别 = 女)','(15<= 年龄 < 15.5 and 23.2<=BMI<26.6 and 性别 = 女)','(15.5<= 年龄 < 16 and 23.4<=BMI<26.9 and 性别 = 女)','(16<= 年龄 < 16.5 and 23.6<=BMI<27.1 and 性别 = 女)','(16.5<= 年龄 < 17 and 23.7<=BMI<27.4 and 性别 = 女)','(17<= 年龄 < 17.5 and 23.8<=BMI<27.6 and 性别 = 女)','(17.5<= 年龄 < 18 and 23.9<=BMI<27.8 and 性别 = 女)','(年龄 = 18 and 23.9<=BMI<27.8 and 性别 = 女)'])


# todo 7-17岁学生 - 肥胖
# Chc_PO.main("7-17岁学生", "肥胖", ['(7<= 年龄 < 7.5 and BMI>=18.7 and 性别 = 男)','(7.5<= 年龄 < 8 and BMI>=19.2 and 性别 = 男)','(8<= 年龄 < 8.5 and BMI>=19.7 and 性别 = 男)','(8.5<= 年龄 < 9 and BMI>=20.3 and 性别 = 男)','(9<= 年龄 < 9.5 and BMI>=20.8 and 性别 = 男)','(9.5<= 年龄 < 10 and BMI>=21.4 and 性别 = 男)','(10<= 年龄 < 10.5 and BMI>=21.9 and 性别 = 男)','(10.5<= 年龄 < 11 and BMI>=22.5 and 性别 = 男)','(11<= 年龄 < 11.5 and BMI>=23.0 and 性别 = 男)','(11.5<= 年龄 < 12 and BMI>=23.6 and 性别 = 男)','(12<= 年龄 < 12.5 and BMI>=24.1 and 性别 = 男)','(12.5<= 年龄 < 13 and BMI>=24.7 and 性别 = 男)','(13<= 年龄 < 13.5 and BMI>=25.2 and 性别 = 男)','(13.5<= 年龄 < 14 and BMI>=25.7 and 性别 = 男)','(14<= 年龄 < 14.5 and BMI>=26.1 and 性别 = 男)','(14.5<= 年龄 < 15 and BMI>=26.4 and 性别 = 男)','(15<= 年龄 < 15.5 and BMI>=26.6 and 性别 = 男)','(15.5<= 年龄 < 16 and BMI>=26.9 and 性别 = 男)','(16<= 年龄 < 16.5 and BMI>=27.1 and 性别 = 男)','(16.5<= 年龄 < 17 and BMI>=27.4 and 性别 = 男)','(17<= 年龄 < 17.5 and BMI>=27.6 and 性别 = 男)','(17.5<= 年龄 < 18 and BMI>=27.8 and 性别 = 男)','(年龄 = 18 and BMI>=27.8 and 性别 = 男)','(7<= 年龄 < 7.5 and BMI>=18.5 and 性别 = 女)','(7.5<= 年龄 < 8 and BMI>=19.0 and 性别 = 女)','(8<= 年龄 < 8.5 and BMI>=19.4 and 性别 = 女)','(8.5<= 年龄 < 9 and BMI>=19.9 and 性别 = 女)','(9<= 年龄 < 9.5 and BMI>=20.4 and 性别 = 女)','(9.5<= 年龄 < 10 and BMI>=21.0 and 性别 = 女)','(10<= 年龄 < 10.5 and BMI>=21.5 and 性别 = 女)','(10.5<= 年龄 < 11 and BMI>=22.1 and 性别 = 女)','(11<= 年龄 < 11.5 and BMI>=22.7 and 性别 = 女)','(11.5<= 年龄 < 12 and BMI>=23.3 and 性别 = 女)','(12<= 年龄 < 12.5 and BMI>=23.9 and 性别 = 女)','(12.5<= 年龄 < 13 and BMI>=24.5 and 性别 = 女)','(13<= 年龄 < 13.5 and BMI>=25.0 and 性别 = 女)','(13.5<= 年龄 < 14 and BMI>=25.6 and 性别 = 女)','(14<= 年龄 < 14.5 and BMI>=25.9 and 性别 = 女)','(14.5<= 年龄 < 15 and BMI>=26.3 and 性别 = 女)','(15<= 年龄 < 15.5 and BMI>=26.6 and 性别 = 女)','(15.5<= 年龄 < 16 and BMI>=26.9 and 性别 = 女)','(16<= 年龄 < 16.5 and BMI>=27.1 and 性别 = 女)','(16.5<= 年龄 < 17 and BMI>=27.4 and 性别 = 女)','(17<= 年龄 < 17.5 and BMI>=27.6 and 性别 = 女)','(17.5<= 年龄 < 18 and BMI>=27.8 and 性别 = 女)','(年龄 = 18 and BMI>=27.8 and 性别 = 女)'])



