# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> >>
# Author     : John
# Created on : 2024-12-19
# Description: 公卫 - 并发创建居民健康档案
# *****************************************************************

import sys,os
current_dir = os.path.dirname(os.path.abspath(__file__))
project_dir = os.path.abspath(os.path.join(current_dir, '..'))
sys.path.insert(0, project_dir)
from GwPO import *
logName = "./" + os.path.basename(__file__).split('.')[0] + ".log"
Gw_PO = GwPO(logName)
from ConfigparserPO import *
Configparser_PO = ConfigparserPO('../config.ini')

from multiprocessing import Pool, cpu_count
import time

from PO.FilePO import *
File_PO = FilePO()


# 1.2.3 更新居民健康档案
def p_main(param):
    return main(param[0], param[1], param[2])

def main(user, password, d_param):
    # 1，登录
    Gw_PO.login('http://192.168.0.203:30080/#/login', user, password)
    # 菜单
    Web_PO.opnLabel('http://192.168.0.203:30080/phs/HealthRecord/Personal')
    Web_PO.swhLabel(1)

    # todo 3 新增
    # 表：T_EHR_INFO
    Gw_PO.phs_healthrecord_personal_new({'button': '仅保存', 'data': d_param})

if __name__ == "__main__":

    time1 = time.time()

    # 获取cpu核数
    print("最大CPU cores: ", cpu_count())
    Gw_PO.logger.info("CPU cores: "+ str(cpu_count()))

    # 使用不同账号并发3个
    print("并发 => 3")
    with Pool(3) as pool:
        # pool.map(p_main,
        #          [('11011', 'HHkk2327447', {"身份证号": "110101202401015310"}, File_PO.jsonfile2dict("./phs/04.json")),
        #           ('11012', 'Jinhao123', {"身份证号": "110118199001019375"}, File_PO.jsonfile2dict("./phs/05.json"))])

        pool.map(p_main, [('11011', 'HHkk2327447', {
                            "身份证号码": Data_PO.getIdCard(),
                            "姓名": Data_PO.getChineseName(), "民族": "回族",
                            "现住址": ["上海市", "市辖区", "虹口区", "广中路街道", "商业一村居委会", "多媒体100号"],
                            "本人电话": Data_PO.getPhone(), "联系人姓名": Data_PO.getChineseName(), "联系人电话": Data_PO.getPhone(), "常住类型": "非户籍",
                            "文化程度": "专科教育", "职业": "军人", "工作单位": "上海智赢", "婚姻状况": "离婚", "血型": "不详",
                            "RH血型": "Rh阳性",
                            "医疗费用支付方式": [["全自费", {"其他": "123"}], {"城镇职工基本医疗保险": "555", "城镇居民基本医疗保险": "666", "贫困救助": "777"}],
                            "药物过敏史": ["青霉素类抗生素", "含碘药品", {"其他药物过敏源": "12345"}],
                            "暴露史": ["化学品", "不详","其他"],
                            "既往史": {"疾病": {"有": [["高血压", [2025, 1, 1]], ["冠心病", [2025, 2, 1]]]},
                                      "手术": {"有": [["手术1", [2025, 1, 3]], ["手术2", [2025, 1, 4]], ["手术3", [2025, 2, 4]]]},
                                      "外伤": {"有": [["外伤1", [2025, 4, 11]], ["外伤2", [2025, 5, 5]]]},
                                      "输血": {"有": [["输血1", [2025, 3, 3]], ["输血2", [2025, 4, 4]]]}},
                            "家族史": {"有": [["高血压", "母亲"], ["糖尿病", "父亲"], ["脑卒中", "子女"]]},
                            "遗传病史": {"有": {"疾病名称": "帕金森"}},
                            "残疾情况": [["听力残疾", "精神残疾", {"其他残疾": "90"}], {"残疾证号": "ab123"}],
                            "家庭情况": {"与户主关系": "子", "户主姓名": Data_PO.getChineseName(), "户主身份证号": Data_PO.getIdCard(), "家庭人口数": "4", "家庭结构": "3", "居住情况": "独居"},
                            "生活环境": {"厨房排风设施": "烟囱", "燃料类型": "煤", "饮水": "井水", "厕所": "马桶", "禽畜栏": "室外"},
                            "管理机构": "招远市卫健局", "档案是否开放": "否",
                            "建档日期": [int(Time_PO.getYear()), int(Time_PO.getMonth()), int(Time_PO.getDay())]
                            }),
                          ('11012', 'Jinhao123', {
                            "身份证号码": Data_PO.getIdCard(),
                            "姓名": Data_PO.getChineseName(), "民族": "回族",
                            "现住址": ["上海市", "市辖区", "虹口区", "广中路街道", "商业一村居委会", "多媒体100号"],
                            "本人电话": Data_PO.getPhone(), "联系人姓名": Data_PO.getChineseName(), "联系人电话": Data_PO.getPhone(), "常住类型": "非户籍",
                            "文化程度": "专科教育", "职业": "军人", "工作单位": "上海智赢", "婚姻状况": "离婚", "血型": "不详",
                            "RH血型": "Rh阳性",
                            "医疗费用支付方式": [["全自费", {"其他": "444"}], {"城镇职工基本医疗保险": "555", "城镇居民基本医疗保险": "666", "贫困救助": "777"}],
                            "药物过敏史": ["青霉素类抗生素", "含碘药品", {"其他药物过敏源": "12345"}],
                            "暴露史": ["化学品", "不详","其他"],
                            "既往史": {"疾病": {"有": [["高血压", [2025, 1, 1]], ["冠心病", [2025, 2, 1]]]},
                                      "手术": {"有": [["手术1", [2025, 1, 3]], ["手术2", [2025, 1, 4]], ["手术3", [2025, 2, 4]]]},
                                      "外伤": {"有": [["外伤1", [2025, 4, 11]], ["外伤2", [2025, 5, 5]]]},
                                      "输血": {"有": [["输血1", [2025, 3, 3]], ["输血2", [2025, 4, 4]]]}},
                            "家族史": {"有": [["高血压", "母亲"], ["糖尿病", "父亲"], ["脑卒中", "子女"]]},
                            "遗传病史": {"有": {"疾病名称": "帕金森"}},
                            "残疾情况": [["听力残疾", "精神残疾", {"其他残疾": "90"}], {"残疾证号": "ab123"}],
                            "家庭情况": {"与户主关系": "子", "户主姓名": Data_PO.getChineseName(), "户主身份证号": Data_PO.getIdCard(), "家庭人口数": "4", "家庭结构": "3", "居住情况": "独居"},
                            "生活环境": {"厨房排风设施": "烟囱", "燃料类型": "煤", "饮水": "井水", "厕所": "马桶", "禽畜栏": "室外"},
                            "管理机构": "招远市卫健局", "档案是否开放": "否",
                            "建档日期": [int(Time_PO.getYear()), int(Time_PO.getMonth()), int(Time_PO.getDay())]
                            }),
                          ('11013', 'Jinhao123',  {
                            "身份证号码": Data_PO.getIdCard(),
                            "姓名": Data_PO.getChineseName(), "民族": "回族",
                            "现住址": ["上海市", "市辖区", "虹口区", "广中路街道", "商业一村居委会", "多媒体100号"],
                            "本人电话": Data_PO.getPhone(), "联系人姓名": Data_PO.getChineseName(), "联系人电话": Data_PO.getPhone(), "常住类型": "非户籍",
                            "文化程度": "专科教育", "职业": "军人", "工作单位": "上海智赢", "婚姻状况": "离婚", "血型": "不详",
                            "RH血型": "Rh阳性",
                            "医疗费用支付方式": [["全自费", {"其他": "9090"}], {"城镇职工基本医疗保险": "555", "城镇居民基本医疗保险": "666", "贫困救助": "777"}],
                            "药物过敏史": ["青霉素类抗生素", "含碘药品", {"其他药物过敏源": "12345"}],
                            "暴露史": ["化学品", "不详","其他"],
                            "既往史": {"疾病": {"有": [["高血压", [2025, 1, 1]], ["冠心病", [2025, 2, 1]]]},
                                      "手术": {"有": [["手术1", [2025, 1, 3]], ["手术2", [2025, 1, 4]], ["手术3", [2025, 2, 4]]]},
                                      "外伤": {"有": [["外伤1", [2025, 4, 11]], ["外伤2", [2025, 5, 5]]]},
                                      "输血": {"有": [["输血1", [2025, 3, 3]], ["输血2", [2025, 4, 4]]]}},
                            "家族史": {"有": [["高血压", "母亲"], ["糖尿病", "父亲"], ["脑卒中", "子女"]]},
                            "遗传病史": {"有": {"疾病名称": "帕金森"}},
                            "残疾情况": [["听力残疾", "精神残疾", {"其他残疾": "90"}], {"残疾证号": "ab123"}],
                            "家庭情况": {"与户主关系": "子", "户主姓名": Data_PO.getChineseName(), "户主身份证号": Data_PO.getIdCard(), "家庭人口数": "4", "家庭结构": "3", "居住情况": "独居"},
                            "生活环境": {"厨房排风设施": "烟囱", "燃料类型": "煤", "饮水": "井水", "厕所": "马桶", "禽畜栏": "室外"},
                            "管理机构": "招远市卫健局", "档案是否开放": "否",
                            "建档日期": [int(Time_PO.getYear()), int(Time_PO.getMonth()), int(Time_PO.getDay())]
                            })
                          ])

    time2 = time.time()
    pool.close()
    pool.join()
    print('总耗时：' + str(int(time2 - time1)) + '秒')
    Gw_PO.logger.info('总耗时：' + str(int(time2 - time1)) + '秒')
    Gw_PO.logger.info('-'.center(50, "-"))
