# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> >>
# Author     : John
# Created on : 2025-3-11
# Description: 基本公卫 - 老年人健康管理 - 老年人抑郁评估查询
# *****************************************************************
from GwPO import *
logName = "./" + os.path.basename(__file__).split('.')[0] + ".log"
Gw_PO = GwPO(logName, '老年人抑郁评估查询')


# todo 1 查询
Gw_PO.phs_snr_depressed_query({"身份证号": "110101193801014615"})
# Gw_PO.phs_snr_depressed_query({"姓名": "胡成", "身份证号": "110101193801014615", '出生日期': [[2025,1,1],[2025,2,2]], '评估日期': [[2025,1,13],[2025,2,12]],
#     "管理机构": "招远市卫健局", '是否仅查询机构': '是',"现住址": ["泉山街道", "花园社区居民委员会", "123"]})


# todo 2 导出
# Gw_PO.export("/Users/linghuchong/Desktop/phs_snr_depressed.xls")


# todo 3 操作 - 详情
# Gw_PO.phs_snr_depressed_operation({'operate': '详情', 'option': {"身份证号": "110101193801014615"}})


# todo 4 操作 - 编辑 (老年人抑郁评估查询)
Gw_PO.phs_snr_depressed_operation({'operate': '编辑', 'option': {"身份证号": "110101193801014615"}})
Gw_PO.phs_snr_depressed_operation({'operate': '编辑', 'data': {
    " 你对生活基本上满意吗？ ": "是",
    " 你是否已经放弃了许多活动和兴趣？ ": "是",
    " 你是否觉的生活空虚？ ": "是",
    " 你是否常感到厌倦？ ": "是",
    " 你觉的未来有希望吗？ ": "是",
    " 你是否因为脑子里有一些想法摆脱不掉而烦恼？ ": "是",
    " 你是否大部分时间精力充沛？ ": "是", " 你是否害怕会有不幸的事落在你头上？ ":"是",
    " 你是否大部分时间感到幸福？ ": "是",
    " 你是否常感到孤立无援？ ": "是",
    " 你是否经常坐立不安，心烦意乱？ ": "是",
    " 你是否希望呆在家里而不愿意去做些新鲜事？ ": "是",
    " 你是否常常担心将来？ ": "是",
    " 你是否觉得记忆力比以前差？ ": "是",
    " 你觉得现在生活很惬意？ ": "是",
    " 你是否常感到心情沉重、郁闷？ ": "是",
    " 你是否觉得像现在这样生活毫无意义？ ": "是",
    " 你是否常为过去的事忧愁？ ": "是",
    " 你开始一件新的工作困难吗？ ": "是",
    " 你觉得生活充满活力吗？ ": "是",
    " 你是否觉得你的处境毫无希望？ ": "是",
    " 你是否觉得大多数人比你强的多？ ": "是",
    " 你是否常为些小事伤心？ ": "是",
    " 你是否常觉得想哭？ ": "是",
    " 你集中精力困难吗？ ": "是",
    " 你早晨起的很快活吗？ ": "是",
    " 你希望避开聚会吗？ ": "是",
    " 你的头脑像往常一样清晰吗？ ": "是"
}
    })

# # todo 5 操作 - 删除
# Gw_PO.phs_snr_depressed_operation({'operate': '删除', 'option': {"身份证号": "110101193801014615"}})

