# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> >>
# Author     : John
# Created on : 2025-3-12
# Description: 基本公卫 - 肺结核患者管理 - 肺结核登记
# *****************************************************************
from GwPO import *
logName = "./" + os.path.basename(__file__).split('.')[0] + ".log"
Gw_PO = GwPO(logName, '肺结核登记')


# todo 1 查询
Gw_PO.phs_tuberculosis_fjhregister_query({"身份证号": "150825198508286004"})
# Gw_PO.phs_tuberculosis_fjhregister_query({"管理机构": "招远市卫健局", '是否仅查询机构': '是', "档案状态": "在档", "姓名": "胡成", "年龄": [2, 5], "身份证号": "110101195901015999",
#     '联系电话': '13816109090'})


# # todo 2 操作 - 新增登记及第一次入户随访
Gw_PO.phs_tuberculosis_fjhregister_operation({'operate': '新增登记及第一次入户随访', 'option': {"身份证号": "150825198508286004"}})
Gw_PO.phs_tuberculosis_fjhregister_operation({'operate': '新增登记及第一次入户随访', 'data': {
    '随访日期': [2025,1,4], '随访方式':'家庭','患者类型':'复治','痰菌情况':'阴性','耐药情况':'未检测','症状及体征':['咳嗽咳痰',{'其他':'123'}],
    '用药':{'化疗方案':'12','用法':'间歇','药品剂型':'注射剂'},'督导人员选择': {'其他': '555'},'家庭居住环境':{'单独的居室':'有', '通风情况':'差'},
    '生活方式评估':{'吸烟':[1,3],'饮酒':[4,6]},
    '健康教育及培训':{'取药地点、时间':['上海家里',[2025,3,4]],'服药记录卡的填写':'未掌握','服药方法及药品存放':'未掌握','肺结核治疗疗程':'未掌握','不规律服药危害':'未掌握',
    '服药后不良反应及处理':'未掌握','治疗期间复诊查痰':'未掌握','外出期间如何坚持服药':'未掌握','生活习惯及注意事项':'未掌握','密切接触者检查':'未掌握'},
    '下次随访日期':[2025,3,5],'随访医生':'金浩1','患者（家属）签字':'zhanzhang'
}})
