# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> >>
# Author     : John
# Created on : 2025-3-17
# Description: 基本公卫 - 严重精神障碍健康管理 - 严重精神障碍登记
# *****************************************************************
from GwPO import *
logName = "./" + os.path.basename(__file__).split('.')[0] + ".log"
Gw_PO = GwPO(logName, '严重精神障碍登记')


# todo 1 查询
Gw_PO.phs_memtalDisorder_jsregister_query({"身份证号": "341226199708114773"})
# Gw_PO.phs_memtalDisorder_jsregister_query({"管理机构": "招远市卫健局", '是否仅查询机构': '是', "档案状态": "在档", "姓名": "胡成", "年龄": [2, 5], "身份证号": "110101195901015999",
#     '联系电话': '13816109090'})


# # # todo 2 操作 - 新增登记及信息补充
Gw_PO.phs_memtalDisorder_jsregister_operation({'operate': '新增登记及信息补充', 'option': {"身份证号": "341226199708114773"}})
Gw_PO.phs_memtalDisorder_jsregister_operation({'operate': '新增登记及信息补充', 'data': {
    '监护人姓名 ': 'A123', ' 与患者关系 ': '本人',
    '监护人地址 ': '上海浦东南路111号', ' 监护人电话 ': '13819181716',
    '辖区村(居)委联系人 ': '女儿guo',' 联系人电话 ': '123813233445',
    '户别 ': '农村', '就业情况 ': '农民',
    '知情同意 ': '不同意参加管理', ' 签字 ': '无残疾', ' 签字日期 ':[2025,2,3], ' 重性精神疾病分类 ': '其他', ' 初次发病时间 ': [2025,3,3],
    ' 既往主要症状 ': ['猜疑', {'其他':'123'}], ' 既往关锁情况 ': '关锁',
    ' 既往治疗情况 ': {'门诊': '未治', '住院':'4'},
    ' 目前诊断情况 ': {'诊断':'3213', '确诊医院':'213', '确诊日期':[2025,2,13]},
    ' 最近一次治疗效果 ': '其他', ' 危险行为 ':{'有':['1','2','3','4','5','6']}, ' 经济状况 ': '非贫困',
    ' 专科医生的意见（如果有请记录）':'金浩1',' 建卡日期':[2025,3,5], ' 建卡医疗机构':'sfdsf'
}})
