# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> >>
# Author     : John
# Created on : 2025-2-5
# Description: 基本公卫 - 健康档案管理 - 家庭健康档案
# *****************************************************************

from GwPO import *
logName = "./" + os.path.basename(__file__).split('.')[0] + ".log"
Gw_PO = GwPO(logName, '家庭健康档案')


# todo 1 查询
# Gw_PO.phs_healthrecord_family_query({"身份证号": "372922198510281068"})
Gw_PO.phs_healthrecord_family_query({"姓名": "丽丽"})
# Gw_PO.phs_healthrecord_family_query({"管理机构": "招远市卫健局", "是否仅查询机构": "是", "姓名": "胡成", "身份证号": "230202194504020016",
#     "现住址": "上海东方路1000号", "家庭住址": ["海阳市", "东村街道", "和平村委会"]})


# todo 2 导出
# Gw_PO.export("/Users/linghuchong/Desktop/family.xlsx")


# todo 3 姓名 (更新)
# Gw_PO.phs_healthrecord_family_operation({'operate': '姓名', 'option': {"姓名": "李丽丽", "档案编号": "372922198510281068"}})
# Gw_PO.phs_healthrecord_family_operation({'operate': '更新', 'data': {
#     ' 姓名 ': "李四", ' 性别 ': "女", ' 出生日期 ': [2024, 2, 2], ' 民族 ': "回族",
#     ' 现住址 ': ["上海市", "市辖区", "虹口区", "广中路街道", "商业一村居委会", "多媒体100号"],
#     ' 本人电话 ': "13815161718", ' 联系人姓名 ': "令狐冲", ' 联系人电话 ': "58771234", ' 常住类型 ': '非户籍',
#     ' 文化程度 ': "专科教育", ' 职业 ': "军人", ' 工作单位 ': "上海智赢", ' 婚姻状况 ': "离婚", ' 血型 ': '不详',
#     ' RH血型 ': 'Rh阳性',
#     ' 医疗费用支付方式 ': [['全自费', {'其他': '123'}], {'城镇职工基本医疗保险': '555', '城镇居民基本医疗保险': '666', '贫困救助': "777"}],
#     ' 药物过敏史 ': ['青霉素类抗生素', '含碘药品', {'其他药物过敏源': "12345"}],
#     ' 暴露史 ': ['化学品', '不详'],
#     ' 既往史 ': {'疾病': {"有": [['高血压', [2025, 1, 1]], ['冠心病', [2025, 2, 1]]]},
#               '手术': {'有': [['手术1', [2025, 1, 3]], ['手术2', [2025, 1, 4]], ['手术3', [2025, 2, 4]]]},
#               '外伤': {"有": [['外伤1', [2025, 4, 11]], ['外伤2', [2025, 5, 5]]]},
#               '输血': {"有": [['输血1', [2025, 3, 3]], ['输血2', [2025, 4, 4]]]}},
#     ' 家族史 ': {'有': [['高血压', '母亲'], ['高血压', '母亲'], ['脑卒中', '子女']]},
#     ' 遗传病史 ': {'有': {"疾病名称": '帕金森'}},
#     ' 残疾情况 ': [['听力残疾', '精神残疾', {'其他残疾': "90"}], {' 残疾证号 ': 'ab123'}],
#     ' 家庭情况 ': {' 与户主关系 ': '子', ' 户主姓名 ': "李四2", ' 户主身份证号 ': "310101198004110013", ' 家庭人口数 ': "4", ' 家庭结构 ': "3", ' 居住情况 ': '独居'},
#     ' 厨房排风设施 ': '烟囱', ' 燃料类型 ': '煤', ' 饮水 ': '自来水', ' 厕所 ': '马桶', ' 禽畜栏 ': '无',
#     ' 管理机构 ': '招远市卫健局', ' 档案是否开放 ': "否", ' 建档日期 ': [2025, 1, 16],
#     ' 更新方式 ': '门诊',' 更新内容 ': "测试三峡",
#     }})

# todo 3 姓名（获取）== 查看
# Gw_PO.phs_healthrecord_family_operation({'operate': '姓名', 'option': {"姓名": "王丽丽"}})
# Gw_PO.phs_healthrecord_family_operation({'operate': '姓名', 'option': {"身份证号": "370624195305061323"}})
# d_ = Gw_PO.phs_healthrecord_family_operation({'operate': '获取', 'data': {}})
# print(d_)  # {'身份证号码': ['372922198510281068'], '档案编号': ['37068500100100157'], ...


# todo 维护家庭成员
# Gw_PO.phs_healthrecord_family_maintenance({'option': {"姓名": "李丽丽"}, 'data': {"户主姓名": "zhangsan", "户主身份证号": "3101011980012343", "与户主关系": "户主"}})






