# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
# Author     : John
# Created on : 2025-2-5
# Description: 基本公卫 - 健康档案管理 - 迁入申请
# *****************************************************************
from GwPO import *
logName = "./" + os.path.basename(__file__).split('.')[0] + ".log"
Gw_PO = GwPO(logName, '迁入申请')


# todo 1 查询
# Gw_PO.phs_healthrecord_immigration_query({"姓名": "六四", "身份证号": "110107199001016298", "申请日期": [[2025, 1, 1], [2025, 1, 2]], "申请机构": "招远市卫健局",
#                                           "是否仅查询机构": "是", "申请人": "test", "状态": "已批准"})
# Gw_PO.phs_healthrecord_immigration_query({"身份证号": "110107199001016298"})
# ' 管理机构 ': "金岭镇卫生院"
# ' 管理机构 ': {"金岭镇卫生院": "金岭镇山上候家村卫生室"}


# todo 2 新增(新增档案迁入)
# Gw_PO.phs_healthrecord_immigration_new({"身份证号": {"370685196005183025": ['六四']}, "申请迁入原因": "不知道test123", "迁入地址": ['山东省', '烟台市', '招远市', '辛庄镇', '小宋家村民委员会', '甲方100号']})
# Gw_PO.phs_healthrecord_immigration_new({"身份证号": {"370685196005183025": ['六四']}})
# Gw_PO.phs_healthrecord_immigration_new({"身份证号": {"370685196005183025": ['六四','peter']}})
# Gw_PO.phs_healthrecord_immigration_new({"身份证号": {"370685196005183025": '全选'}})
# Gw_PO.phs_healthrecord_immigration_new({"身份证号": {"370685196005183025": '无'}})


# todo 3 查看
d_ = Gw_PO.phs_healthrecord_immigration_operation({'operate': '查看', 'option': {"姓名": "黄忠文"}})
print(d_)


# todo 4 姓名 (更新)
# Gw_PO.phs_healthrecord_immigration_operation({'operate': '姓名', 'option': {"姓名": "李丽丽", "档案编号": "372922198510281068"}})
# Gw_PO.phs_healthrecord_immigration_operation({'operate': '更新', 'data': {
#     ' 姓名 ': "李四", ' 性别 ': "女", ' 出生日期 ': [2024, 2, 2], ' 民族 ': "回族",
#     ' 现住址 ': ["上海市", "市辖区", "虹口区", "广中路街道", "商业一村居委会", "多媒体100号"],
#     ' 本人电话 ': "13815161718", ' 联系人姓名 ': "令狐冲", ' 联系人电话 ': "58771234", ' 常住类型 ': '非户籍',
#     ' 文化程度 ': "专科教育", ' 职业 ': "军人", ' 工作单位 ': "上海智赢", ' 婚姻状况 ': "离婚", ' 血型 ': '不详',
#     ' RH血型 ': 'Rh阳性',
#     ' 医疗费用支付方式 ': [['全自费', {'其他': '123'}], {'城镇职工基本医疗保险': '555', '城镇居民基本医疗保险': '666', '贫困救助': "777"}],
#     ' 药物过敏史 ': ['青霉素类抗生素', '含碘药品', {'其他药物过敏源': "12345"}],
#     ' 暴露史 ': ['化学品', '不详'],
#     ' 既往史 ': {'疾病': {"有": [['高血压', [2025, 1, 1]], ['冠心病', [2025, 2, 1]]]},
#               '手术': {'有': [['手术1', [2025, 1, 3]], ['手术2', [2025, 1, 4]], ['手术3', [2025, 2, 4]]]},
#               '外伤': {"有": [['外伤1', [2025, 4, 11]], ['外伤2', [2025, 5, 5]]]},
#               '输血': {"有": [['输血1', [2025, 3, 3]], ['输血2', [2025, 4, 4]]]}},
#     ' 家族史 ': {'有': [['高血压', '母亲'], ['高血压', '母亲'], ['脑卒中', '子女']]},
#     ' 遗传病史 ': {'有': {"疾病名称": '帕金森'}},
#     ' 残疾情况 ': [['听力残疾', '精神残疾', {'其他残疾': "90"}], {' 残疾证号 ': 'ab123'}],
#     ' 家庭情况 ': {' 与户主关系 ': '子', ' 户主姓名 ': "李四2", ' 户主身份证号 ': "310101198004110013", ' 家庭人口数 ': "4", ' 家庭结构 ': "3", ' 居住情况 ': '独居'},
#     ' 厨房排风设施 ': '烟囱', ' 燃料类型 ': '煤', ' 饮水 ': '自来水', ' 厕所 ': '马桶', ' 禽畜栏 ': '无',
#     ' 管理机构 ': '招远市卫健局', ' 档案是否开放 ': "否", ' 建档日期 ': [2025, 1, 16],
#     ' 更新方式 ': '门诊',' 更新内容 ': "测试三峡",
#     }})

# todo 4 姓名（获取）
# Gw_PO.phs_healthrecord_immigration_operation({'operate': '姓名', 'option': {"姓名": "王丽丽"}})
Gw_PO.phs_healthrecord_immigration_operation({'operate': '姓名', 'option': {"身份证号": "370602199404212115"}})
d_ = Gw_PO.phs_healthrecord_immigration_operation({'operate': '获取', 'data': {}})
print(d_)  # {'身份证号码': ['372922198510281068'], '档案编号': ['37068500100100157'], ...








