# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> >>
# Author     : John
# Created on : 2025-3-13
# Description: 基本公卫 - 残疾人健康管理 - 残疾人登记
# *****************************************************************
from GwPO import *
logName = "./" + os.path.basename(__file__).split('.')[0] + ".log"
Gw_PO = GwPO(logName, '残疾人登记')


# todo 1 查询
Gw_PO.phs_disabled_cjrregister_query({"身份证号": "340203201707013526"})
# Gw_PO.phs_disabled_cjrregister_query({"管理机构": "招远市卫健局", '是否仅查询机构': '是', "档案状态": "在档", "姓名": "胡成", "年龄": [2, 5], "身份证号": "110101195901015999",
#     '联系电话': '13816109090'})


# # todo 2 操作 - 新增专项登记
Gw_PO.phs_disabled_cjrregister_operation({'operate': '新增专项登记', 'option': {"身份证号": "340203201707013526"}})
Gw_PO.phs_disabled_cjrregister_operation({'operate': '新增专项登记', 'data': {
    '残疾人证号 ': 'A123', '致残时间 ': [2025,1,4], '自理程度 ': '部分自理', ' 生活来源 ': '家庭供养', ' 监护人 ': '没有', ' 与残疾人关系 ': '女儿',
    ' 当前状态 ': '其他',' 管理等级 ': '三级',' 功能障碍 ': '324324',
    ' 致残原因 ': ['遗传', '其他'],' 主要残疾类型 ': ['无残疾'], ' 多重残疾类型 ': ['视力残疾','其他残疾'], ' 残疾程度 ': '二级',
    ' 赡养老人数 ':'1', ' 抚养子女数 ': '2',' 特长 ': '碎觉', ' 主要情况 ': 'dssdf', '培训经历 ':'热热热', '备注 ':'大是大非水电费',
    ' 登记人':'金浩1',' 登记时间':[2025,3,5],' 居民（家属）签字':'zhanzhang'
}})
