# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> >>
# Author     : John
# Created on : 2025-2-7
# Description: 基本公卫 - 慢性阻塞性肺病管理 - 慢阻肺病专项
# *****************************************************************
from GwPO import *
logName = "./" + os.path.basename(__file__).split('.')[0] + ".log"
Gw_PO = GwPO(logName, '慢阻肺病专项')


# todo 1 查询
Gw_PO.phs_copd_project_query({"身份证号": "370685198705183027"})
# Gw_PO.phs_copd_project_query({"姓名": "胡成", "身份证号": "110101193901013599",
#                               "上次随访日期": [[2025, 1, 1], [2025, 1, 2]], "下次随访日期": [[2025, 1, 3], [2025, 1, 4]],
#                               "建卡日期": [[2025, 2, 1], [2025, 2, 2]], "建档日期": [[2025, 2, 3], [2025, 2, 4]],
#                               "档案管理机构": "招远市卫健局", "档案状态": "在档",
#                               "是否终止管理": "否", "随访提醒分类": "常规管理", "建卡医生": "zhangsan",
#                               "出生日期范围": [[2025, 2, 5], [2025, 2, 6]], "现住址": ["泉山街道", "花园社区居民委员会", "123"],
#                               "随访评价结果": "不良反应"})

# todo 2 导出(.xls)
# Gw_PO.phs_copd_project_export("/Users/linghuchong/Desktop/phs_copd_project.xls")


# todo 3 详情
# Gw_PO.phs_copd_project_operation({'operate': '详情', 'option': {"身份证号": "370685198705183027"}})
# Gw_PO.phs_copd_project_operation({'operate': '详情', 'index': {'operate2': '编辑'},
#                                    'value':{' 居住地址 ': ['上海市', '市辖区', '虹口区', '广中路街道', '商业一村居委会', '多媒体100号'],
#                                    ' 确诊日期 ': [2024, 7, 1],
#                                    ' 是否终止管理 ': '是', '终止管理日期': [2025, 2, 5], '终止管理原因': "nono",
#                                    '建卡时间': [2025, 2, 2], '建卡医生': "卫生院"}})



# todo 4 随访 - 编辑
# Gw_PO.phs_copd_project_operation({'operate': '随访', 'option': {'建卡日期': '2024-07-09'}})  # 无历史随访记录，编辑新增


# todo 4 随访 - 新增
Gw_PO.phs_copd_project_operation({'operate': '随访', 'option': {"身份证号": "370685198705183027"}})
Gw_PO.phs_copd_project_operation({'operate': '随访', 'index': {'operate2': '新增'},
                                   'value': {'随访日期': [2025, 2, 9], '随访方式': '网络', '症状': ['呼吸困难', {'其他': '123'}, '发热'],
                                   '口唇紫绀': '100', '外周水肿': '101', '呼吸频率': '12', '心率': '44', '体质指数': '55', '其他': "测试一下",
                                   '合并症': ['感染', {'其他': '12345'}, '肺癌'], '日吸烟量': '56',
                                   '运动本次': [11, 23], '运动目标':[12, 44],
                                   '心理调整': '一般', '遵医行为': '差',
                                   '疫苗免疫史':{'有': ['流感疫苗', '新冠病毒疫苗']}, 'SpO₂': '12', 'FEV1': '23', 'FVC': '55', 'FEV1/ FVC': '44',
                                   '用药情况药物名称1':'test1', '用药情况用法用量1每日':'每日一次', '用药情况用法用量1每次':'1',
                                   '用药情况药物名称2':'test2', '用药情况用法用量2每日':'每日二次', '用药情况用法用量2每次':'2',
                                   '用药情况药物名称3':'test3', '用药情况用法用量3每日':'每日三次', '用药情况用法用量3每次':'3',
                                   '服药依从性': '间断', '药物不良反应': ['有','5555'],
                                   '家庭氧疗': [2, 100, ['有', '456']], '无创呼吸机使用': [3, 300, ['有', '77']],
                                   '随访评价结果': '不良反应', '下一步管理措施': "两次控制不满意转诊随访",
                                   '用药调整意见药物名称1':'test4', '用药调整意见用法用量1每日':'一次性', '用药调整意见用法用量1每次':'4',
                                   '用药调整意见药物名称2':'test5', '用药调整意见用法用量2每日':'必要时', '用药调整意见用法用量2每次':'5',
                                   '用药调整意见药物名称3':'test6', '用药调整意见用法用量3每日':'一次性', '用药调整意见用法用量3每次':'6',
                                   '转诊原因':'123', '机构及科室':'456', '联系人及电话': ['lisi', '57665432'], '结果':'到位', '备注':'nonono',
                                   '下次随访日期': [2025, 2, 9], '随访医生': '测试1', '居民签字': '张三丰'}})


# todo 4 随访 - 引入上次新增
Gw_PO.phs_copd_project_operation({'operate': '随访', 'option': {"身份证号": "370685198705183027"}})
Gw_PO.phs_copd_project_operation({'operate': '随访', 'index': {'operate2': '引入上次新增'},
                                   'value': {'随访日期': [2025, 2, 9], '下次随访日期': [2025, 2, 9]}})