# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> >>
# Author     : John
# Created on : 2025-2-7
# Description: 基本公卫 - 高血压管理 - 高血压专项
# *****************************************************************
from GwPO import *
logName = "./" + os.path.basename(__file__).split('.')[0] + ".log"
Gw_PO = GwPO(logName, '高血压专项')


# todo 1 查询
Gw_PO.phs_hypertension_gxyregister_query({"姓名": "李丽丽"})
# Gw_PO.phs_hypertension_gxyregister_query({"身份证号": "110101199001012256"})
# Gw_PO.phs_hypertension_gxyregister_query({"姓名": "胡成", "身份证号": "230202194504020016", "上次随访日期": [[2025, 1, 1], [2025, 1, 2]],"下次随访日期": [[2025, 1, 3], [2025, 1, 4]],
#                                           "建卡日期": [[2025, 2, 1], [2025, 2, 2]],"建档日期": [[2025, 2, 3], [2025, 2, 4]], "建卡医生": "zhangsan", "高血压危险分层": "高危层",
#                                           "是否终止管理": "否", "收缩压范围": [11, 12], "舒张压范围": [13, 14], "随访提醒分类": "常规管理",
#                                           "档案管理机构": "招远市卫健局", "档案状态": "在档", "现住址": ["泉山街道", "花园社区居民委员会", "123"],
#                                           "出生日期范围": [[2025, 2, 5], [2025, 2, 6]], "随访评价结果": "不良反应"})


# todo 2 导出
# Gw_PO.export("/Users/linghuchong/Desktop/phs_hypertension_gxyregister.xlsx")


#
# # todo 3 详情 - 编辑(高血压患者管理卡)
Gw_PO.phs_hypertension_gxyregister_operation({'operate': '详情', 'option': {'建卡日期': '2024-07-09'}})
# Gw_PO.phs_hypertension_gxyregister_operation({'operate': '详情', 'operate2': '编辑',
#                                                'data': {' 居住地址 ': ['上海市', '市辖区', '虹口区', '广中路街道', '商业一村居委会', '多媒体100号'],
#                                                ' 确诊日期 ': [2024, 7, 1], ' 管理级别 ': "二级",
#                                                ' 是否终止管理 ': '否', ' 终止管理日期 ': [2025, 2, 5], ' 终止管理原因 ': "nono",
#                                                ' 建卡时间 ': [2025, 2, 2], ' 建卡医生 ':"卫生院", ' 建卡医疗机构 ': "待定机构"}})



# # todo 4 评估 - 新增(高血压患者评估)
# Gw_PO.phs_hypertension_gxyregister_operation({'operate': '评估', 'option': {'建卡日期': '2024-07-09'}})
# Gw_PO.phs_hypertension_gxyregister_operation({'operate': '评估', 'operate2': '新增',
#                                                'data': {' 血压 ': [11, 12], ' 身高(cm) ': "177", ' 体重(kg) ': "55",
#                                                ' 危险因素 ': ['男性>55 岁或女性>65 岁', '以静息为主的生活方式'],
#                                                ' 靶器官损害 ': ['颈动脉超声 IMT>=0.9mm或动脉粥样斑块超声或X线证实有动脉粥样斑块（颈、髂、股或主动脉）', '蛋白尿和／或血浆肌酐浓度轻度升高106 ~ 177μmol ／ L （ 1.2 ~ 2.0mg/dl）'],
#                                                ' 并发症情况 ':['脑出血', '视网膜病变 ( 出血或渗出，视乳头水肿)'],
#                                                ' 高血压分级 ': '二级高血压', ' 危险分层 ': '高危层', ' 评估日期 ': [2025, 2, 3]}})



# todo 5.1 随访 - 新增
# Gw_PO.phs_hypertension_gxyregister_operation({'operate': '随访', 'option': {'建卡日期': '2025-01-14'}})  # 有历史随访记录，点击新增
# Gw_PO.phs_hypertension_gxyregister_operation({'operate': '随访', 'option': {'建卡日期': '2024-07-09'}})  # 无历史随访记录，编辑新增
# Gw_PO.phs_hypertension_gxyregister_operation({'operate': '随访', 'operate2': '新增', 'data': {
# '随访日期': [2025, 3, 9], '随访方式': '网络', '症状': ['头痛头晕', {'其他': '123'}, '下肢水肿'],
# '血压': [1, 2], '身高': '166', '体重': [33, 44], '心率':'90', '其他': "测试2下",
# '日吸烟量':[5, 7], '日饮酒量':[110, 244],
# '运动频率实际': '每天', '运动频率目标': '不运动',
# '运动时长':[6, 22], '摄盐量分级实际': '轻', '摄盐量分级目标': '中', '随访饮食合理性评价': '合理', '心理调整评价结果': '差', '随访遵医行为': '一般',
# '辅助检查': '1212', '服药依从性': '间断', '药物不良反应': ['有','5555'], '随访评价结果': '不良反应', '下一步管理措施': "两次控制不满意转诊随访",
# '用药情况药物名称1':'阿莫西林100', '用药情况用法用量1每日':'每日一次', '用药情况用法用量1每次':'1',
# '用药情况药物名称2':'阿莫西林冲剂', '用药情况用法用量2每日':'每日二次', '用药情况用法用量2每次':'2',
# '用药情况药物名称3':'阿莫西林测试', '用药情况用法用量3每日':'每日三次', '用药情况用法用量3每次':'3',
# '用药调整意见药物名称1':'阿莫西林胶囊', '用药调整意见用法用量1每日':'一次性', '用药调整意见用法用量1每次':'4',
# '用药调整意见药物名称2':'阿莫西林钠克拉维酸钾（二叶克）', '用药调整意见用法用量2每日':'必要时', '用药调整意见用法用量2每次':'5',
# '用药调整意见药物名称3':'阿莫西林钠/克拉维酸钾', '用药调整意见用法用量3每日':'一次性', '用药调整意见用法用量3每次':'6',
# '转诊原因':'qqq', '转入医疗机构及科室':'www', '联系人':'eee', '联系人电话':'rrr', '结果':'不到位', '备注':'good',
# '下次随访日期': [2025, 1, 19], '随访医生':'测试2', '居民签字': '李泽楷'}})


# # todo 5.2 随访 - 引入上次新增
# Gw_PO.phs_hypertension_gxyregister_operation({'operate': '随访', 'option': {'建卡日期': '2025-01-14'}})
# Gw_PO.phs_hypertension_gxyregister_operation({'operate': '随访', 'operate2': '引入上次新增',
#                                           "data": {'随访日期': [2025, 2, 9], '下次随访日期': [2025, 5, 9]}})


# todo 6 姓名 (更新)
# Gw_PO.phs_hypertension_gxyregister_operation({'operate': '姓名', 'option': {"姓名": "李丽丽", "档案编号": "372922198510281068"}})
# Gw_PO.phs_hypertension_gxyregister_operation({'operate': '姓名', 'operate2': '更新', 'data': {
#     ' 姓名 ': "李四", ' 性别 ': "女", ' 出生日期 ': [2024, 2, 2], ' 民族 ': "回族",
#     ' 现住址 ': ["上海市", "市辖区", "虹口区", "广中路街道", "商业一村居委会", "多媒体100号"],
#     ' 本人电话 ': "13815161718", ' 联系人姓名 ': "令狐冲", ' 联系人电话 ': "58771234", ' 常住类型 ': '非户籍',
#     ' 文化程度 ': "专科教育", ' 职业 ': "军人", ' 工作单位 ': "上海智赢", ' 婚姻状况 ': "离婚", ' 血型 ': '不详',
#     ' RH血型 ': 'Rh阳性',
#     ' 医疗费用支付方式 ': [['全自费', {'其他': '123'}], {'城镇职工基本医疗保险': '555', '城镇居民基本医疗保险': '666', '贫困救助': "777"}],
#     ' 药物过敏史 ': ['青霉素类抗生素', '含碘药品', {'其他药物过敏源': "12345"}],
#     ' 暴露史 ': ['化学品', '不详'],
#     ' 既往史 ': {'疾病': {"有": [['高血压', [2025, 1, 1]], ['冠心病', [2025, 2, 1]]]},
#               '手术': {'有': [['手术1', [2025, 1, 3]], ['手术2', [2025, 1, 4]], ['手术3', [2025, 2, 4]]]},
#               '外伤': {"有": [['外伤1', [2025, 4, 11]], ['外伤2', [2025, 5, 5]]]},
#               '输血': {"有": [['输血1', [2025, 3, 3]], ['输血2', [2025, 4, 4]]]}},
#     ' 家族史 ': {'有': [['高血压', '母亲'], ['高血压', '母亲'], ['脑卒中', '子女']]},
#     ' 遗传病史 ': {'有': {"疾病名称": '帕金森'}},
#     ' 残疾情况 ': [['听力残疾', '精神残疾', {'其他残疾': "90"}], {' 残疾证号 ': 'ab123'}],
#     ' 家庭情况 ': {' 与户主关系 ': '子', ' 户主姓名 ': "李四2", ' 户主身份证号 ': "310101198004110013", ' 家庭人口数 ': "4", ' 家庭结构 ': "3", ' 居住情况 ': '独居'},
#     ' 厨房排风设施 ': '烟囱', ' 燃料类型 ': '煤', ' 饮水 ': '自来水', ' 厕所 ': '马桶', ' 禽畜栏 ': '无',
#     ' 管理机构 ': '招远市卫健局', ' 档案是否开放 ': "否", ' 建档日期 ': [2025, 1, 16],
#     ' 更新方式 ': '门诊',' 更新内容 ': "测试三峡",
#     }})

# todo 6 姓名（获取）
Gw_PO.phs_hypertension_gxyregister_operation({'operate': '姓名', 'option': {"姓名": "刘长春"}})
# # Gw_PO.phs_hypertension_gxyregister_operation({'operate': '姓名', 'option': {"建卡日期": "2024-07-09"}})
# d_ = Gw_PO.phs_hypertension_gxyregister_operation({'operate': '姓名', 'operate2': '获取', 'data': {}})
# print(d_)  # {'身份证号码': ['372922198510281068'], '档案编号': ['37068500100100157'], ...

