# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> >>
# Author     : John
# Created on : 2025-2-25
# Description: 基本公卫 - 孕产妇管理 - 孕产妇随访
# *****************************************************************
import sys,os
# 获取当前文件的绝对路径
current_dir = os.path.dirname(os.path.abspath(__file__))
# 获取 上层 目录的绝对路径
project_dir = os.path.abspath(os.path.join(current_dir, '..'))
# 将 上层 目录添加到 sys.path
sys.path.insert(0, project_dir)
from GwPO import *
logName = "./" + os.path.basename(__file__).split('.')[0] + ".log"
Gw_PO = GwPO(logName)
from ConfigparserPO import *
Configparser_PO = ConfigparserPO('../config.ini')
# 登录
Gw_PO.login(Configparser_PO.HTTP("url"), Configparser_PO.ACCOUNT("user"), Configparser_PO.ACCOUNT("password"))
# 菜单
d_menu_basicPHS = {'健康档案概况': 'http://192.168.0.203:30080/phs/HealthRecord/ehrindex', '个人健康档案': 'http://192.168.0.203:30080/phs/HealthRecord/Personal', '家庭健康档案': 'http://192.168.0.203:30080/phs/HealthRecord/Family', '迁入申请': 'http://192.168.0.203:30080/phs/HealthRecord/Immigration', '迁出审核': 'http://192.168.0.203:30080/phs/HealthRecord/Exit', '档案交接': 'http://192.168.0.203:30080/phs/HealthRecord/handoverFile', '死亡管理': 'http://192.168.0.203:30080/phs/HealthRecord/DeathManagement', '区域档案查询': 'http://192.168.0.203:30080/phs/HealthRecord/regionalFile', '接诊信息查询': 'http://192.168.0.203:30080/phs/HealthRecord/Diagnosis', '就诊管理': 'http://192.168.0.203:30080/phs/HealthRecord/Visit', '高血压专项': 'http://192.168.0.203:30080/phs/Hypertension/gxyregister', '高血压随访': 'http://192.168.0.203:30080/phs/Hypertension/gxyjob', '高血压报病': 'http://192.168.0.203:30080/phs/Hypertension/gxybb', '糖尿病专项': 'http://192.168.0.203:30080/phs/Diabetes/tnbregister', '糖尿病随访': 'http://192.168.0.203:30080/phs/Diabetes/tnbjob', '糖尿病报病': 'http://192.168.0.203:30080/phs/Diabetes/tnbbb', '慢阻肺病登记': 'http://192.168.0.203:30080/phs/Copd/register', '慢阻肺病专项': 'http://192.168.0.203:30080/phs/Copd/project', '慢阻肺病随访': 'http://192.168.0.203:30080/phs/Copd/visit', '儿童概况': 'http://192.168.0.203:30080/phs/Child/etindex', '儿童健康档案': 'http://192.168.0.203:30080/phs/Child/etfiles', '中医体质辨识列表': 'http://192.168.0.203:30080/phs/Child/tcm', '中医体质辨识汇总': 'http://192.168.0.203:30080/phs/Child/tzbs', '儿童检查记录': 'http://192.168.0.203:30080/phs/Child/etjob', '孕产妇概况': 'http://192.168.0.203:30080/phs/MaternalRecord/ycfindex', '孕产妇登记': 'http://192.168.0.203:30080/phs/MaternalRecord/ycfregister', '孕产妇档案': 'http://192.168.0.203:30080/phs/MaternalRecord/ycffiles', '孕产妇随访': 'http://192.168.0.203:30080/phs/MaternalRecord/ycfjob', '老年人概况': 'http://192.168.0.203:30080/phs/Snr/lnrindex', '老年人专项登记': 'http://192.168.0.203:30080/phs/Snr/special', '老年人专项管理': 'http://192.168.0.203:30080/phs/Snr/lnrfiles', '本年度未体检': 'http://192.168.0.203:30080/phs/Snr/unexamined', '老年人中医体质辨识': 'http://192.168.0.203:30080/phs/Snr/chMedicine', '老年人自理能力评估查询': 'http://192.168.0.203:30080/phs/Snr/selfCareAssess', '老年人抑郁评估查询': 'http://192.168.0.203:30080/phs/Snr/depressed', '简易智力检查查询': 'http://192.168.0.203:30080/phs/Snr/intelligence', '体检登记': 'http://192.168.0.203:30080/phs/HealthExamination/tjregister', '体检记录': 'http://192.168.0.203:30080/phs/HealthExamination/tjrecord', '未体检人员': 'http://192.168.0.203:30080/phs/HealthExamination/tjunexam', '肺结核患者概况': 'http://192.168.0.203:30080/phs/Tuberculosis/fjhindex', '肺结核登记': 'http://192.168.0.203:30080/phs/Tuberculosis/fjhregister', '肺结核管理': 'http://192.168.0.203:30080/phs/Tuberculosis/fjhfiles', '残疾人概况': 'http://192.168.0.203:30080/phs/Disabled/cjrindex', '残疾人登记': 'http://192.168.0.203:30080/phs/Disabled/cjrregister', '残疾人管理': 'http://192.168.0.203:30080/phs/Disabled/cjrfiles', '严重精神障碍登记': 'http://192.168.0.203:30080/phs/MentalDisorder/jsregister', '严重精神障碍患者': 'http://192.168.0.203:30080/phs/MentalDisorder/jsfiles', '严重精神病障碍随访': 'http://192.168.0.203:30080/phs/MentalDisorder/jsjob', '严重精神障碍概况': 'http://192.168.0.203:30080/phs/MentalDisorder/jsindex', '健康教育活动': 'http://192.168.0.203:30080/phs/HealthEducation/HealthActivity', '本年度未评': 'http://192.168.0.203:30080/phs/hbp/noassessdata', '评分信息查询': 'http://192.168.0.203:30080/phs/hbp/assessdata'}
Web_PO.opnLabel(d_menu_basicPHS['孕产妇随访'])
Web_PO.swhLabel(1)



# todo 1 查询
Gw_PO.phs_maternalRecord_ycfjob_query({"身份证号": "110101199001014243"})
# Gw_PO.phs_maternalRecord_ycfjob_query({"管理机构": "招远市卫健局", '是否仅查询机构': '是', "姓名": "胡成", "身份证号": "110101199001014243",
#                                        '检查类型': '产后访视', "随访日期": [[2024, 2, 2], [2024, 3, 3]]})


# # todo 2 编辑
# Gw_PO.phs_maternalRecord_ycfjob_operation({'operate': '编辑', 'option': {"身份证号": "110101199001014243", '检查类型': '第2次产前检查服务'}})
# 第一次产前随访服务记录表
# Gw_PO.phs_maternalRecord_ycfjob_operation({'title': '第一次产前随访服务记录表', 'data': {
#     '填表日期': [2024, 1, 1], '是否高危产妇': '是', '丈夫姓名': '阿依达', '丈夫年龄': '43', '丈夫电话': '13611223344',
#     '孕次': '1', '产次': ['2', '3'], '末次月经': [2024, 2, 2], '孕周': ['4', '5'], '预产期': [2024, 3, 3],
#     '既往史': ['心脏病', {'其他': '1231'}],
#     '家族史': ['精神病史', {'其他': '456'}], '妇科手术史': {'有': '234234'},
#     '个人史': ['吸烟', {'其他': '4yyy'}], '孕产史': ['1','2','3','4','5','6'],
#     '身高(cm)': '166', '体重(kg)': '66', '体质指数(kg/m²)': '123', '血压(mmHg)': ['100', '98'],
#     '心脏': {'异常': '1'}, '肺部': {'异常': '2'}, '外阴': {'异常': '3'}, '阴道': {'异常': '4'}, '宫颈': {'异常': '5'}, '子宫': {'异常': '6'}, '附件': {'异常': '7'},
#     '血常规': {'血红蛋白值': '23', '白细胞计数值': '44', '血小板计数值': '235', '其他': '更好'},
#     '尿常规': {'尿蛋白': '+', '尿糖': '++', '尿酮体': '+++', '尿潜血': '++++', '其他': '5677'},
#     '血型': '不详', 'RH血型': 'Rh阳性', ' 血糖': '67',
#     '肝功能': {'血清谷丙转氨酶': '3434', '血清谷草转氨酶': '56', '白蛋白':'434', '总胆红素':'234', '结合胆红素':'66'},
#     '肾功能': {'血清肌酐': '77', '血尿素': '88'},
#     ' 阴道分泌物': ['滴虫', {'其他': '45'}], '阴道清洁度': 'III度',
#     '乙型肝炎五项': {'乙型肝炎表面抗原': '阳性', ' 乙型肝炎表面抗体': '不详', ' 乙型肝炎e抗原': '不详', ' 乙型肝炎e抗体': '不详', ' 乙型肝炎核心抗体': '不详'},
#     ' 梅毒血清学试验': '阳性', ' HIV抗体检测': '阳性',
#     'B超': 'ert', ' 其他': 'rtyrtyrtyrty',
#     '总体评估': {'异常': '234234'}, '保健指导': ['心理', '产前筛选宣传告知', {'其他':'23423'}], '建册情况': {'已在其他机构建册': '5t5t'},
#     '建册日期': [2025, 2, 6], '建册单位': '自己家',
#     '转诊': {'有': {'原因': '44', '机构及科室': '内科', '联系人': '张明全', '联系方式': '58776565', '结果': '到位'}},
#     '下次访视时间': [2025, 3, 5], '随访医生签名': '金浩1', '居民签名': 'peter'
# }})

# 第2～5次产前随访服务记录表
# Gw_PO.phs_maternalRecord_ycfjob_operation({'title': '第2～5次产前随访服务记录表', 'data': {
#     '第2次': {'日期': [2024, 1, 1], '本次服务类别': {'随访': ''}, '随访方式': '电话', '孕周': ["1", "3"], '产前检查机构名称': '1', '主诉': '2', '体重（kg）': '100',
#         '宫底高度(cm)': '144', '腹围(cm)': '88', '胎位': ['右枕前（ROA）', '左枕后（LOP）', '左颏前（LMA）'], '胎心率(次/分钟)': ['45', '66', '88'],
#         '血压（mmHg）': ['111', '99'], '血红蛋白（g/L）': '234', '尿蛋白': '+', '其他辅助检查': '678',
#         '免费血清学产前筛查': {'是': ['爱德华氏综合征', '唐氏综合征']}, '随访结果分类': {'异常': '13123'}, '指导': ['营养', {'其他': '4234'}],
#         '转诊': {'有': {'原因': '不知道', '机构及科室': '心脏科', '联系人': 'winter', '联系方式': '13611012345', '结果': '到位'}},
#         '下次随访日期': [2024, 4, 1], '随访医生签名': '金浩1', '居民签名': "666"},
#     '第3次': {'日期': [2024, 2, 2], '本次服务类别': {'督促': ''}, '随访方式': '门诊', '孕周': ["4", "5"],
#         '产前检查机构名称': '2', '主诉': 'no', '体重（kg）': '111','宫底高度(cm)': '155','腹围(cm)': '45', '胎位': ['右枕前（ROA）', '右枕后（ROP）'], '胎心率(次/分钟)': ['65','44'],
#         '血压（mmHg）': ['118', '100'],'血红蛋白（g/L）': '56','尿蛋白': '+++', '其他辅助检查': 'uu8',
#         '随访结果分类': {'异常': 'ww13123'}, '指导': ['营养', '心理', {'其他': 'rt4234'}],
#         '转诊': {'有': {'原因': '56', '机构及科室': '外科', '联系人': 'wawa', '联系方式': '13312122334','结果': '未到位'}},
#         '下次随访日期': [2024, 5, 1], '随访医生签名': '1', '居民签名': "yoy12"},
#     '第4次': {'日期': [2024, 3, 3], '本次服务类别': {'失访': {'失访原因': '123'}}, '下次随访日期': [2024, 6, 1], '随访医生签名': '金浩1', '居民签名': "888"},
#     '第5次': {'日期': [2024, 4, 4], '本次服务类别': {'随访': ''}, '随访方式': '电话', '孕周': ["1", "3"],
#         '产前检查机构名称': '1', '主诉': '2', '体重（kg）': '100', '宫底高度(cm)': '144', '腹围(cm)': '88', '胎位': ['右枕前（ROA）', '右枕后（ROP）'], '胎心率(次/分钟)': ['45','88'],
#         '血压（mmHg）': ['111', '99'], '血红蛋白（g/L）': '234', '尿蛋白': '++', '其他辅助检查': '678',
#         '随访结果分类': {'异常': '13123'}, '指导': ['心理', '自我监测', {'其他': '4234'}],
#         '转诊': {'有': {'原因': '不知道', '机构及科室': '心脏科', '联系人': 'winter', '联系方式': '13611012345', '结果': '到位'}},
#         '下次随访日期': [2024, 7, 1], '随访医生签名': '金浩1', '居民签名': "999"},
# }})

# 产后访视记录表
# Gw_PO.phs_maternalRecord_ycfjob_operation({'title': '产后访视记录表', 'data':
#     {'随访日期': [2024, 4, 4], '本次服务类别': {'失访': {'失访原因': '123'}}, '分娩日期': [2024, 2, 4], '出院日期': [2024, 5, 4],
#      '体温(­°C)': '23', '血压(mmHg)': ['100','98'], '一般健康情况': 'lianghao', '一般心理状况': '88',
#     '乳房': {'未见异常': ''}, '恶露': {'异常': '4434'}, '子宫': {'异常': '1212'}, '伤口': {'异常': '4421234'},
#     '其他': '123', '分类': {'异常': '13123'},
#     '指导': ['心理', {'其他': '4234'}],
#     '转诊': {'有': {'转诊原因': '不知道', '转诊机构及科室': '心脏科', '联系人': 'winter', '联系方式': '13611012345', '结果': '到位'}},
#     '下次随访日期': [2024, 7, 1], '随访医生签名': '6', '居民签名': "999"}})
#
# # 产后42天健康检查记录表
# Gw_PO.phs_maternalRecord_ycfjob_operation({'title': '产后42天健康检查记录表', 'data':
#     {'随访日期': [2024, 4, 4], '本次服务类别': {'失访': {'失访原因': '123'}}, '分娩日期': [2024, 2, 4], '出院日期': [2024, 5, 4],
#     '血压(mmHg)': ['100','98'], '一般健康情况': 'lianghao', '一般心理状况': '88',
#     '乳房': {'未见异常': ''}, '恶露': {'异常': '4434'}, '子宫': {'异常': '1212'}, '伤口': {'异常': '4421234'},
#     '其他': '123', '产后检查机构名称': '777', '分类': {'未恢复': '13123'},
#     '指导': ['婴儿喂养', {'其他': '4234'}],
#     '处理': {'转诊': {'转诊原因': '不知道', '转诊机构及科室': '心脏科', '联系人': 'winter', '联系方式': '13611012345', '结果': '到位'}},
#     '随访医生签名': '6'}})


# todo 3 删除
# Gw_PO.phs_maternalRecord_ycfjob_operation({'operate': '删除', 'option': {"身份证号": "110101199001014243", '检查类型': '第2次产前检查服务'}})


# todo 4 姓名 - (更新居民健康档案) http://192.168.0.203:30080/phs/personalAddOrUpdate/addOrUpdate/417?id=417&type=1
