# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> >>
# Author     : John
# Created on : 2025-2-7
# Description: 基本公卫 - 慢性阻塞性肺病管理 - 慢阻肺病登记
# *****************************************************************
from GwPO import *
logName = "./" + os.path.basename(__file__).split('.')[0] + ".log"
Gw_PO = GwPO(logName, '慢阻肺病登记')


# todo 1 查询
Gw_PO.phs_copd_register_query({"身份证号": "340203202407017263"})
# Gw_PO.phs_copd_register_query({"管理机构": "招远市卫健局", "档案状态": "在档", "姓名": "胡成", '年龄': [12, 14],
#                                       "身份证号": "341226199708114773","联系电话": "13815102030",'既往疾病史': ["脑卒中",'高血压'], "现住址": ["泉山街道", "花园社区居民委员会", "123"] })



# todo 2 专项登记
Gw_PO.phs_copd_register_operation({'operate': '专项登记', 'option': {"身份证号": "340203202407017263"}})
Gw_PO.phs_copd_register_operation({'operate': '专项登记', 'data': {
    ' 居住地址 ': ['上海市', '市辖区', '虹口区', '广中路街道', '商业一村居委会', '多媒体100号'],
    ' 确诊日期 ': [2024, 7, 1],
    ' 是否终止管理 ': '是', '终止管理日期': [2025, 2, 5], '终止管理原因': "nono",
    '建卡时间': [2025, 2, 2], '建卡医生': "卫生院"}})




