-- todo 用药信息，药物名称	规格	频次	每次用量	用量单位	用法	总量

CREATE OR ALTER PROCEDURE r_drug_info__
    @v1 nvarchar(50) OUTPUT,
    @v2 nvarchar(50) OUTPUT,
    @v3 nvarchar(50) OUTPUT,
    @v4 nvarchar(50) OUTPUT,
    @v5 nvarchar(50) OUTPUT,
    @v6 nvarchar(50) OUTPUT,
    @v7 nvarchar(100) OUTPUT
AS
BEGIN
    SET NOCOUNT ON;

    -- 生成临时表
    IF OBJECT_ID('tempdb..#tb_temp') IS NOT NULL DROP TABLE #tb_temp;
    CREATE TABLE #tb_temp (ID INT IDENTITY(1,1), v1 NVARCHAR(50), v2 NVARCHAR(150), v3 NVARCHAR(50)
                          , v4 NVARCHAR(50), v5 NVARCHAR(50), v6 NVARCHAR(50), v7 NVARCHAR(100));
    INSERT INTO #tb_temp (v1, v2, v3, v4, v5, v6, v7) VALUES
        ('氨氯地平片', '5mg', '每日 1 次', '1', '片', '口服', '30片/月'),
        ('厄贝沙坦片', '150mg', '每日 1 次', '1', '片', '口服', '30片/月'),
        ('利伐沙班片', '20mg', '每日 1 次', '1', '片', '口服', '30片/月'),
        ('美托洛尔缓释片', '47.5mg', '每日 1 次', '1', '片', '口服', '30片/月'),
        ('二甲双胍缓释片', '0.5g', '每日 2 次', '1', '片', '口服', '60片/月'),
        ('度拉糖肽注射液', '1.5mg', '每周 1 次', '1', '支', '皮下注射', '4支/月'),
        ('单硝酸异山梨酯片', '20mg', '每日 2 次', '1', '片', '口服', '60片/月'),
        ('阿托伐他汀钙片', '20mg', '每晚 1 次', '1', '片', '口服', '30片/月'),
        ('布地奈德福莫特罗', '160/4.5μg', '每日 2 次', '1', '吸', '吸入', '60吸/月'),
        ('莫西沙星片', '400mg', '每日 1 次', '1', '片', '口服', '7片/疗程'),
        ('阿司匹林肠溶片', '100mg', '每日 1 次', '1', '片', '口服', '30片/月'),
        ('阿托伐他汀钙片', '40mg', '每晚 1 次', '1', '片', '口服', '30片/月'),
        ('奥美拉唑肠溶胶囊', '20mg', '每日 2 次', '1', '粒', '口服', '60粒/月'),
        ('铝碳酸镁咀嚼片', '0.5g', '每日 3 次', '2', '片', '嚼服', '180片/月'),
        ('阿仑膦酸钠片', '70mg', '每周 1 次', '1', '片', '口服', '4片/月'),
        ('骨化三醇软胶囊', '0.25μg', '每日 1 次', '1', '粒', '口服', '30粒/月'),
        ('甲巯咪唑片', '5mg', '每日 3 次', '1', '片', '口服', '90片/月'),
        ('普萘洛尔片', '10mg', '每日 3 次', '1', '片', '口服', '90片/月'),
        ('缬沙坦胶囊', '80mg', '每日 1 次', '1', '粒', '口服', '30粒/月'),
        ('碳酸司维拉姆片', '800mg', '每日 3 次', '1', '片', '口服', '90片/月');


    -- 随机选择一个 ID
    DECLARE @RandomID INT = CAST(RAND() * (SELECT COUNT(*) FROM #tb_temp) AS INT) + 1;

    -- 赋值输出参数
    SELECT @v1 = v1, @v2 = v2, @v3 = v3, @v4 = v4, @v5 = v5, @v6 = v6, @v7 = v7 FROM #tb_temp WHERE ID = @RandomID;
END
