# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
# Author     : John
# Created on : 2025-2-5
# Description: 基本公卫 - 高血脂管理 - 高血脂专项
# *****************************************************************
from GwPO_three import *
logName = "./" + os.path.basename(__file__).split('.')[0] + ".log"
Gw_PO_three = GwPO_three(logName, '高血脂专项')


# todo 1 查询
Gw_PO_three.query({"身份证号": "370685202205080014"})
# Gw_PO_three.query({"姓名": "胡成", "身份证号": "370685202205080014", '上次随访日期': [[2025,1,2],[2025,2,3]], '下次随访日期': [[2025,4,1],[2025,4,3]],
#                    '建卡日期': [[2025, 1, 12], [2025, 2, 13]], '建档日期': [[2025, 4, 11], [2025, 4, 13]],
#                    "档案管理机构": "招远市卫健局", '是否仅查询机构': '是', '档案状态': '在档', '是否终止管理': '是','随访提醒分类':'常规管理',
#                    '随访评价结果': '不良反应'})


# todo 导出
# Gw_PO_three.export('../data/三高共管/GwPO_three_Hyperlipidemia_gxzregister.xlsx')


# # # todo 3。1 查看
# Gw_PO_three.three_Hyperlipidemia_gxzspecial_operation({'operate': '查看', 'option': {"身份证号": "370685202205080014"}})
# Gw_PO_three.three_Hyperlipidemia_gxzspecial_operation({'operate': '高血脂患者管理卡_编辑', 'data': {
#     '病例来源': '其他',
#     '居住地址': ['上海市', '市辖区', '黄浦区', '外滩街道', '北京居委会','123'],
#     '高血脂分层结果': '高危',
#     '确诊日期': [2025,1,2], '是否终止管理': ['是', {'终止管理日期': [2025,2,5], '终止管理原因': '121212'}],
#     '建卡时间': [2025,1,5], '建卡医生': '金浩1'
# }})

# # todo 3。2 随访
Gw_PO_three.three_Hyperlipidemia_gxzspecial_operation({'operate': '随访', 'option': {"身份证号": "370685202205080014"}})
Gw_PO_three.three_Hyperlipidemia_gxzspecial_operation({'operate': '高血脂随访记录_新增', 'data': {
    # '病例来源': '其他',
    # '居住地址': ['上海市', '市辖区', '黄浦区', '外滩街道', '北京居委会','123'],
    # '高血脂分层结果': '高危',
    # '确诊日期': [2025,1,2], '是否终止管理': ['是', {'终止管理日期': [2025,2,5], '终止管理原因': '121212'}],
    # '建卡时间': [2025,1,5], '建卡医生': '金浩1'
}})

Gw_PO_three.three_Hyperlipidemia_gxzspecial_operation({'operate': '高血脂随访记录_引入上次新增', 'data': {
    # '病例来源': '其他',
    # '居住地址': ['上海市', '市辖区', '黄浦区', '外滩街道', '北京居委会','123'],
    # '高血脂分层结果': '高危',
    # '确诊日期': [2025,1,2], '是否终止管理': ['是', {'终止管理日期': [2025,2,5], '终止管理原因': '121212'}],
    # '建卡时间': [2025,1,5], '建卡医生': '金浩1'
}})