# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
# Author     : John
# Created on : 2025-2-5
# Description: 基本公卫 - 三高共管 - 并发症管理
# *****************************************************************
from GwPO_three import *
logName = "./" + os.path.basename(__file__).split('.')[0] + ".log"
Gw_PO_three = GwPO_three(logName, '并发症管理')


# todo 1 查询
# Gw_PO_three.query({"身份证号": "370685198705183027"})
Gw_PO_three.query({"管理机构": "招远市卫健局", '档案状态': '在档', "姓名": "胡成", "身份证号": "372922198510281068", '采集日期': [[2025,1,2],[2025,2,3]],
    '并发症筛查': ['心电图', '肾功能'], '并发症类型': ['脑血管病变', '外周血管病变'], "现住址":["泉山街道", "花园社区居民委员会","123"]})



