# coding: utf-8
# ********************************************************************************************************************
# Author     : John
# Date       : 2025.3.12
# Description: 4. LTP（哈工大语言技术平台）
# 用途：哈工大开发的中文自然语言处理工具，支持分词、词性标注、命名实体识别等功能。
# 获取与使用：
# 安装：pip install ltp
# ********************************************************************************************************************
from ltp import LTP
ltp = LTP()
text = "我喜欢自然语言处理"
result = ltp.pipeline([text], tasks=["cws", "pos"])
print(result)
