# coding: utf-8
# ********************************************************************************************************************
# Author     : John
# Date       : 2025.3.12
# Description: 6. SnowNLP
# 用途：一个简单的中文自然语言处理库，支持分词、情感分析、文本分类等。
# 获取与使用：
# 安装：pip install snownlp
# ********************************************************************************************************************
from snownlp import SnowNLP
text = "我喜欢自然语言处理"
s = SnowNLP(text)
print(s.words)  # ['我', '喜欢', '自然', '语言', '处理']
