# coding: utf-8
# ********************************************************************************************************************
# Author     : John
# Date       : 2025.3.12
# Description: 5. THULAC（清华大学中文词法分析工具）
# 用途：清华大学开发的中文分词和词性标注工具。
# 获取与使用：
# 安装：pip install thulac
# ********************************************************************************************************************
import thulac
thu = thulac.thulac()
text = "我喜欢自然语言处理"
result = thu.cut(text)
print(result)

# Model loaded succeed
# [['我', 'r'], ['喜欢', 'v'], ['自然', 'n'], ['语言', 'n'], ['处理', 'v']]
