# -*- coding: utf-8 -*-
# *****************************************************************
# Author     : John
# Date       : 2025-04-20
# Description: 上海，爬取数据
# 步骤：
# 爬取数据，如# {3: ['3', '600179', '安通控股', '股吧', '资金流', '数据', '2.73', '-8.39%', '-0.25', '118.55万', '3.27亿', '5.03%', '2.85', '2.70', '2.83', '2.98', '4.04', '3.17%', '11.96', '1.05'],
# 3，保存到sz.json
# *****************************************************************
import sys
import os
sys.path.append(os.path.abspath(os.path.join(os.path.dirname(__file__), '../../..')))

import warnings
warnings.filterwarnings("ignore", category=UserWarning, module="openpyxl.styles.stylesheet")


from PO.WebPO import *

from PO.TimePO import *
Time_PO = TimePO()

from PO.ColorPO import *
Color_PO = ColorPO()

from ConfigparserPO import *
Configparser_PO = ConfigparserPO('config.ini')
from PO.LogPO import *
Log_PO = LogPO(filename=Configparser_PO.DATA("logfile"), level="info")
# jsonFile = Configparser_PO.DATA("jsonfile")  # 第一轮筛选stock的文件
jsonFile = "sz.json"


# # test
# l_data = ['沪股通(港>沪)收盘 当日额度充足 深股通(港>深)收盘 当日额度充足 港股通(沪>港)有额度净买额 38.59亿 港股通(深>港)有额度净买额 -4336.28万', '1 600805 悦达投资 股吧 资金流 数据 5.34 10.10% 0.49 70.91万 3.72亿 10.31% 5.34 4.84 4.84 4.85 1.82 8.34% 71.77 1.04', '2 600495 晋西车轴 股吧 资金流 数据 5.25 10.06% 0.48 157.29万 7.99亿 10.48% 5.25 4.75 4.76 4.77 0.91 13.02% 202.81 1.94', '3 605167 利柏特 股吧 资金流 数据 11.73 10.04% 1.07 30.36万 3.44亿 10.88% 11.73 10.57 10.58 10.66 0.95 6.76% 36.72 2.81', '4 603506 南都物业 股吧 资金流 数据 12.17 10.04% 1.11 12.91万 1.52亿 7.23% 12.17 11.37 11.40 11.06 4.01 6.88% 19.38 2.04', '5 603518 锦泓集团 股吧 资金流 数据 9.99 10.02% 0.91 65.73万 6.52亿 4.07% 9.99 9.62 9.89 9.08 4.28 19.10% 9.73 0.96', '6 603680 今创集团 股吧 资金流 数据 10.87 10.02% 0.99 12.64万 1.32亿 10.12% 10.87 9.87 9.90 9.88 3.78 1.61% 14.26 1.56', '7 603076 乐惠国际 股吧 资金流 数据 30.31 10.02% 2.76 11.76万 3.43亿 12.74% 30.31 26.80 27.00 27.55 2.53 9.75% 102.33 2.88', '8 601579 会稽山 股吧 资金流 数据 25.81 10.02% 2.35 57.57万 14.65亿 4.82% 25.81 24.68 25.81 23.46 2.07 12.01% 33.00 3.42', '9 605188 国光连锁 股吧 资金流 数据 14.06 10.02% 1.28 38.11万 5.15亿 10.95% 14.06 12.66 12.66 12.78 1.47 7.69% 80.09 6.12', '10 603693 江苏新能 股吧 资金流 数据 15.27 10.01% 1.39 9.19万 1.40亿 0.00% 15.27 15.27 15.27 13.88 0.30 1.03% 20.79 1.98', '11 605388 均瑶健康 股吧 资金流 数据 8.46 10.01% 0.77 4.32万 3658.77万 0.00% 8.46 8.46 8.46 7.69 0.54 0.72% 116.44 2.86', '12 600192 长城电工 股吧 资金流 数据 8.90 10.01% 0.81 52.38万 4.49亿 11.37% 8.90 7.98 8.00 8.09 3.34 11.86% -24.62 3.45', '13 603577 汇金通 股吧 资金流 数据 11.32 10.01% 1.03 69.29万 7.75亿 7.87% 11.32 10.51 11.32 10.29 6.91 20.43% 64.18 2.05', '14 603011 合锻智能 股吧 资金流 数据 17.81 10.01% 1.62 156.18万 26.58亿 15.94% 17.81 15.23 15.60 16.19 1.27 31.59% 297.79 4.08', '15 600612 老凤祥 股吧 资金流 数据 54.31 10.01% 4.94 9.24万 4.88亿 10.69% 54.31 49.03 49.03 49.37 4.89 2.91% 11.59 2.17', '16 603639 海利尔 股吧 资金流 数据 16.28 10.00% 1.48 37.73万 6.13亿 2.64% 16.28 15.89 16.28 14.80 10.84 11.10% 13.18 1.57', '17 605033 美邦股份 股吧 资金流 数据 23.44 10.00% 2.13 23.98万 5.52亿 5.58% 23.44 22.25 23.00 21.31 1.61 17.73% 26.45 2.74', '18 603390 通达电气 股吧 资金流 数据 15.96 9.99% 1.45 9.57万 1.53亿 0.00% 15.96 15.96 15.96 14.51 0.17 2.74% 74.89 3.52', '19 605005 合兴股份 股吧 资金流 数据 17.73 9.99% 1.61 7.17万 1.26亿 10.48% 17.73 16.04 16.17 16.12 7.53 1.79% 34.18 3.54', '20 605599 菜百股份 股吧 资金流 数据 16.74 9.99% 1.52 15.89万 2.54亿 11.63% 16.74 14.97 15.03 15.22 2.27 2.04% 10.18 2.99']
# l_data.pop(0)
# # print(l_data)
# l_all = []
# for i in l_data:
#     l_ = i.split(" ")
#     print(l_) # ['1', '600805', '悦达投资', '股吧', '资金流', '数据', '5.34', '10.10%', '0.49', '70.91万', '3.72亿',
#     # '10.31%', '5.34', '4.84', '4.84', '4.85', '1.82', '8.34%', '71.77', '1.04']
#     # 条件是跌的; 换手率小于10; 市盈率大于0且小于100；
#     l_17 = l_[17].replace("%",'')  # 换手率
#     if float(l_[8]) <= 0 and float(l_17) <= 10 and float(l_[18]) > 0 and float(l_[18]) < 100:
#         l_all.append(l_)


# sys.exit(00)



# varUrl = "https://quote.eastmoney.com/center/gridlist.html#sh_a_board_hzz"
varUrl = "https://quote.eastmoney.com/center/gridlist.html#sz_a_board_zcz"

# Web_PO = WebPO("chrome")
Web_PO = WebPO("noChrome")
Web_PO.openURL(varUrl)

# 涨跌幅降序
element = Web_PO.driver.find_element(By.XPATH, "//div[@class='quotetable']/table/thead/tr/th[6]")
Web_PO.driver.execute_script("arguments[0].click();", element)

# 获取总页数
l_page = Web_PO.getTextByXs("//div[@class='qtpager']")
# print(l_page) # ['123…83>转到']
pageTotal = l_page[0].split("…")[1].split(">")[0]
# print(pageTotal)  # 83


d_all = {}
for j in range(int(pageTotal)-1):
    # print(j)
# for j in range(2):

    # 获取每页数据
    l_data = Web_PO.getTextByXs("//tbody/tr")
    l_data.pop(0)
    for i in l_data:
        l_ = i.split(" ")
        # print(l_)  # ['1', '600805', '悦达投资', '股吧', '资金流', '数据', '5.34', '10.10%', '0.49', '70.91万', '3.72亿',
        # '10.31%', '5.34', '4.84', '4.84', '4.85', '1.82', '8.34%', '71.77', '1.04']
        # todo 条件是跌的(跌幅在2-8个点); 换手率小于10; 市盈率大于0且小于100；
        l7 = int(float(l_[7].replace("%", ''))) # 涨跌幅
        # print(l7)
        # l7 = l_[7].replace("%", '').replace("-", '')  # 涨跌幅
        l17 = l_[17].replace("%", '')  # 换手率
        if l7 > -8 and l7 < -2 and float(l17) < 10 and float(l_[18]) > 0 and float(l_[18]) < 100:
            d_all[int(l_[0])] = l_

        # 判断涨跌幅是否大于0，大于0则退出循环
        if l7 >= -2:
            print(d_all)
            # {3: ['3', '600179', '安通控股', '股吧', '资金流', '数据', '2.73', '-8.39%', '-0.25', '118.55万', '3.27亿', '5.03%', '2.85', '2.70', '2.83', '2.98', '4.04', '3.17%', '11.96', '1.05'],
            print("合计：",len(d_all))
            try:
                # 打开文件并写入 JSON 数据
                with open(jsonFile, 'w', encoding='utf-8') as file:
                    # 使用 json.dump 将字典写入文件
                    json.dump(d_all, file, ensure_ascii=False, indent=4)
                # print(f"数据已成功保存到 {jsonFile}")
                Color_PO.outColor([{"35": f"数据已成功保存到 {jsonFile}"}])
            except Exception as e:
                print(f"保存文件时出现错误: {e}")

            exit(0)

    # 切换页数
    Web_PO.setTextByX("//form[@class='gotoform']/input[1]", j+2)
    # 点击GO
    # 绕过页面交互限制，通过执行 JS 脚本来点击目标元素：
    element = Web_PO.driver.find_element(By.XPATH, "//form[@class='gotoform']/input[2]")
    Web_PO.driver.execute_script("arguments[0].click();", element)

